Tekla Open API Reference for Tekla Structures 2025
ProfileItemEnumerator Class
 The ProfileItemEnumerator class allows to loop through the catalog profile items.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ProfileItemEnumerator
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ProfileItemEnumerator : IEnumerator
<SerializableAttribute>
Public NotInheritable Class ProfileItemEnumerator
	Implements IEnumerator
The ProfileItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a profile item instance of the current element.
SelectInstances
 Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator. The user can set this to 'false' if no members are ever asked from the instance. This is the case when, for example, asking only for the available profile names or when only certain profiles need to be selected from the model. Without the selection the 'Current' item contains the profile name or the prefix and the profile type. Warning: normally the user should not change this value.
Top
Methods
Name | Description
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
Examples
 The following example returns true if a library profile item with the name HEA300 has been found:
using Tekla.Structures.Catalogs;
public class Example
{
    public bool Example1()
    {
        bool Result = false;
        CatalogHandler CatalogHandler = new CatalogHandler();
        if (CatalogHandler.GetConnectionStatus())
        {
            ProfileItemEnumerator ProfileItemEnumerator = CatalogHandler.GetLibraryProfileItems();
            while (ProfileItemEnumerator.MoveNext())
            {
                LibraryProfileItem LibraryProfileItem = ProfileItemEnumerator.Current as LibraryProfileItem;
                if (LibraryProfileItem.ProfileName == "HEA300")
                {
                    Result = true;
                    break;
                }
            }
        }
        return Result;
    }
}
See Also
Reference
Tekla.Structures.Catalogs Namespace